# Introduction to pandas :

What is Pandas -
- pandas is open source python library.
- provide high performance and easy to use data structure and analysis tools.
- it built top on the Numpy, therefore it is use in data science , machin learning and scientific computing.

Why use Pandas -
- work well with structure data like Tables, Excel spreadsheet and SQL databases.
- it build on numpy so it allowing to vectorised operation for speed.
-  it is flexible for Data Manupulation and it offers filtering, merging ,grouping and sorting.
-  we can handles Missing Values It provide the method to detect , remove and fill missing value.
-  Support multiple file format. Here we read and write CSV, Excel, JSON, SQL files.
-  pandas library efficiently  work with Matplotlib, Scikit and Numpy Library.

We can install pandas by folling command -
   we also use -->> conda install pandas

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\anacondadist\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\anacondadist\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\anacondadist\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\anacondadist\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\anacondadist\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\anacondadist\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

# Key Data Structure :

Pasdas provide Two Data Structure -

#### 1) Series (1-D Data) :
  - Similer to one dimentional Numpy Array but with labeled Indices.
  - that Numpy Array hold Intregers, String, float and Python object.

#### 2) DataFrame (2-D Data) :
 - Similer to Excel Spreadsheet and SQL table.
 - consist os Rows and columns.

## 1) Series (1-D Data) :

####  Creating a Series -

Create a Series by tuple

In [79]:
tuple1=(11,12,13,14,15,16,17)  # tuple and list are Ordered so we create Series by using tuple and list both.
tf=pd.Series(tuple1)
tf

0    11
1    12
2    13
3    14
4    15
5    16
6    17
dtype: int64

In [76]:
type(tf)

pandas.core.series.Series

We can not create Series by set

In [78]:
set1={1,2,3,4,5,6}    # Error Occor -->> because set is unordered.
sf=pd.Series(set1)
sf

TypeError: 'set' type is unordered

Creating a series by dictionary

In [10]:
dic={'A':45,'B':70,'C':35,'D':91,'E':75}
df=pd.Series(dic,name='Mark')
df

A    45
B    70
C    35
D    91
E    75
Name: Mark, dtype: int64

In [11]:
type(df)

pandas.core.series.Series

Creating a Series from a list

In [1]:
import pandas as pd

In [19]:
pd.Series([1,2,3,4,5],index=['a','b','c','d','e'],name=['salary'])  # TypeError: Series.name must be a hashable type

TypeError: Series.name must be a hashable type

### What is a Hashable Type?
- A hashable type is an object that can be used as a dictionary key and has a fixed hash value throughout its lifetime.

#### Hashable Types (Allowed) :
1) Strings ("name")
2) Numbers (1, 2.5)
3) Tuples (("A", "B"))
#### Unhashable Types (Not Allowed) :
1) Lists (["A", "B"])
2) Dictionaries ({"key": "value"})
3) Sets ({"A", "B"})

In [11]:
pd.Series([1,2,3,4,5],index=['a','b','c','d','e'],name='salary')  # we can not pass list because list is unhashable.

a    1
b    2
c    3
d    4
e    5
Name: salary, dtype: int64

In [13]:
pd.Series([1,2,3],name='salary') # It take row index By default -->> starting from 0,1,...

0    1
1    2
2    3
Name: salary, dtype: int64

In [18]:
s=pd.Series([4,5,6])   # we can add name by s.name='salary' -->> string is hasheble
s.name='salary'

In [20]:
s

0    4
1    5
2    6
Name: salary, dtype: int64

### Characteristic of Series : a single Series is similer to -->> List or 1-D Array.
 1) indexing : each element has an associated index no. (label).
 2) Heterogeneous data can store in Series.
 3) support vectorised operation like Numpy Array.
 4) Handle missing value like-->> NaN

#### Accessing element in Series

In [23]:
s1=pd.Series([10,11,12,13,14],index=['a','b','c','d','e'],name='salary',dtype=float)
s1

a    10.0
b    11.0
c    12.0
d    13.0
e    14.0
Name: salary, dtype: float64

In [25]:
s1['a']

10.0

In [27]:
s1[3]

C:\Users\HP\AppData\Local\Temp\ipykernel_12448\1653704576.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s1[3]

13.0

##### Assigning NaN Values in a Mixed-Element Pandas Series:
1) Use np.nan or None for Missing value (Default Behaviour).
2) In pandas pd.NA used for missing value (for better handling in mixed-type datasets).
3) Pandas automatically treats None as NaN ,When working with Series.

In [70]:
import numpy as np
s2=pd.Series([50,'ram',70.99,80+2j,np.nan,None,pd.NA],name='salary')
s2

0         50
1        ram
2      70.99
3    (80+2j)
4        NaN
5       None
6       <NA>
Name: salary, dtype: object

In [71]:
type(s2)

pandas.core.series.Series

In [37]:
s2.isnull()

0    False
1    False
2    False
3    False
4     True
5     True
6     True
Name: salary, dtype: bool

In [38]:
s2[s2.isnull()]

4     NaN
5    None
6    <NA>
Name: salary, dtype: object

### 2. DataFrame (2D Labeled Table):
    A dataFrame is Two-Dimentional data structure that consist of rows and columns.

### Characteristic of Data Frame :
1) Tabular structure of Rows and Columns are present with labeled axis.
2) Heterogeneous Data: Can hold different data types in different columns
3) Indexing: Supports row and column indexing.
4) Data Manipulation: Easy filtering, sorting, and grouping.
5) Handles Missing Data: Can detect, drop and fill NaN values.

#### - Creating a DataFrame :

1) Creating a DataFrame from usung Dictionary :

In [43]:
dic={'Name': ['AIS','jaydeep','sujit','pravin','shubham','sourabh'],
    'Age': [40,22,24,21,23,25],
    'Salary':[5000,3000,500,250,150,100]}
df=pd.DataFrame(dic)
df

      Name  Age  Salary
0      AIS   40    5000
1  jaydeep   22    3000
2    sujit   24     500
3   pravin   21     250
4  shubham   23     150
5  sourabh   25     100

2) Creating a DataFrame from List of Dictionaries :

In [14]:
list_of_dictionaries= [{"Name": "Alice", "Age": 25, "City": "New York"},
        {"Name": "Bob", "Age": 30, "City": "Los Angeles"},
        {"Name": "Charlie", "Age": 35, "City": "Chicago"}]

In [15]:
data=pd.DataFrame(list_of_dictionaries)
data

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

3) Creating a DataFrame by using 2-D Array

In [59]:
arr=np.array([[1,2,3,4,5],[6,7,8,9,10]])
arr

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

In [64]:
pd.DataFrame(arr,index=['a','b'],columns=['AIS','jaydeep','shubham','sujit','sourabh'],dtype=float,copy=False)

   AIS  jaydeep  shubham  sujit  sourabh
a  1.0      2.0      3.0    4.0      5.0
b  6.0      7.0      8.0    9.0     10.0

In [66]:
## Using copy=True (Default)
df1=pd.DataFrame({'A':[10,20,30]})
df1

    A
0  10
1  20
2  30

In [77]:
type(df1)  # we cen see type of object -->> by using type()

pandas.core.frame.DataFrame

In [73]:
df2=df1.copy()
df2

    A
0  10
1  20
2  30

In [84]:
df2['A'][0]=100  # Here we use -->> nested indexing In particular fetched one column.

In [85]:
print(df2)

     A
0  100
1   20
2   30

In [86]:
df1

    A
0  10
1  20
2  30

In [81]:
df2[df2['A']>20]

    A
2  30

#### Accessing Data in DataFrame :

- Select a column (return a Series).

In [48]:
df['Salary']   # here-->> key act as -->> index. like In list we access one element by indexing l[0]

0    5000
1    3000
2     500
3     250
4     150
5     100
Name: Salary, dtype: int64

- Select multiple column's

df[['Age','Salary']]    # like fancy indexing there we can access more than one element in different order

- Select Row by index Position

In [52]:
df

      Name  Age  Salary
0      AIS   40    5000
1  jaydeep   22    3000
2    sujit   24     500
3   pravin   21     250
4  shubham   23     150
5  sourabh   25     100

In [53]:
df.iloc[0]   # Here we select single Row by Index position.

Name       AIS
Age         40
Salary    5000
Name: 0, dtype: object

- Select Row by index label.

In [55]:
dic={'Name': ['AIS','jaydeep','sujit','pravin','shubham','sourabh'],
    'Age': [40,22,24,21,23,25],
    'Salary':[5000,3000,500,250,150,100]}
df=pd.DataFrame(dic,index=['a','b','c','d','e','f'])
df

      Name  Age  Salary
a      AIS   40    5000
b  jaydeep   22    3000
c    sujit   24     500
d   pravin   21     250
e  shubham   23     150
f  sourabh   25     100

In [57]:
df.loc['e']   # Here we select single Row by index label.

Name      shubham
Age            23
Salary        150
Name: e, dtype: object

### Operations on Series and DataFrame

1) Operation on Series

In [89]:
s=pd.Series([10,20,30,40]) # Here [10,20,30,40] is -->> 1-D Array in Numpy
s

0    10
1    20
2    30
3    40
dtype: int64

In [93]:
# We can Perform -->> all Numpy mathematical ,statistical operation -->> For Series
# Therefore we can say that-->> 1-D Array operation == Series operation.

s.sum()       # sum of all element of column

100

In [94]:
s.mean()      # mean of all element of column

25.0

In [97]:
s + 5     # 1st perform Broadcasting and then perform element-wise addition. -->> like array addition
          # output gives in DataFrame like structure

0    15
1    25
2    35
3    45
dtype: int64

2) Operation on DataFrame

In [100]:
arr=np.array([[1,2,3,4,5],[6,7,8,9,10]])
df=pd.DataFrame(arr,index=['a','b'],columns=['AIS','jaydeep','shubham','sujit','sourabh'],dtype=int,copy=False)
df

   AIS  jaydeep  shubham  sujit  sourabh
a    1        2        3      4        5
b    6        7        8      9       10

In [102]:
df.sum()   # Gives By default Column-wese sum  # same like Array column-wise sum for axis=0

AIS         7
jaydeep     9
shubham    11
sujit      13
sourabh    15
dtype: int64

In [105]:
df.sum(axis=1)  # Gives Row-wise sum-->> for axis=1 like in numpy Array

a    15
b    40
dtype: int64

In [108]:
df.mean() # Gives column-wise mean # Bydefault it take axis=0

AIS        3.5
jaydeep    4.5
shubham    5.5
sujit      6.5
sourabh    7.5
dtype: float64

In [111]:
df.mean(axis=1)   # Gives row-wise mean

a    3.0
b    8.0
dtype: float64

Convert Series to DataFrame :

In [112]:
s=pd.Series([10,20,30,40]) # Here [10,20,30,40] is -->> 1-D Array in Numpy
s

0    10
1    20
2    30
3    40
dtype: int64

In [113]:
type(s)

pandas.core.series.Series

In [121]:
s1=s.to_frame()   # here we convert Series to DataFrame by using this function --->>   .to_frame()    
s1                ####    .to_frame()

    0
0  10
1  20
2  30
3  40

In [116]:
type(s1)

pandas.core.frame.DataFrame

- Convert DataFrame to Series :
    1) We can't convert DataFrame into a Series.
    2) but we can fetch single Column from entire dataset(dataframe) and that single fetched column having type is -->> Series.
    3) Because DataFrame is made by combining more than one Series.

In [122]:
arr=np.array([[1,2,3,4,5],[6,7,8,9,10]])
df=pd.DataFrame(arr,index=['a','b'],columns=['AIS','jaydeep','shubham','sujit','sourabh'],dtype=int,copy=False)
df

   AIS  jaydeep  shubham  sujit  sourabh
a    1        2        3      4        5
b    6        7        8      9       10

In [123]:
type(df)

pandas.core.frame.DataFrame

In [127]:
df1=df['AIS']  # We can't convert DataFrame in to a Series
df1            # but fetched single column act as Series.

a    1
b    6
Name: AIS, dtype: int32

In [128]:
type(df1)

pandas.core.series.Series

#### Filtering Data (Row's) By Applying Single Condition.

In [21]:
data = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 30, 35],
        "City": ["New York", "Los Angeles", "Chicago"]}
df=pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [22]:
df[df['Age']>28]    # here we Select -->> Row's by giving condition where age is greater than 28

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

#### Filtering Data (Row's) By applyng Multiple Condition.

In [23]:
df[(df['Age']>28) & (df['City']=='Chicago')]            # Select row's where Age > 28 and City is "Chicago"

      Name  Age     City
2  Charlie   35  Chicago

#### Adding a New Column in existing DataFrame.

In [24]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [25]:
df['Salary']=[200,1000,150]  # by giving column name and its value

In [26]:
df

      Name  Age         City  Salary
0    Alice   25     New York     200
1      Bob   30  Los Angeles    1000
2  Charlie   35      Chicago     150

#### Modifying an Existing Column of Age by Increasing 1

In [27]:
# Increase each value of age by 1

In [28]:
df['Age'] = df['Age'] + 1   # If we Fetched -->> 'age' <<--  single column from DataFrame. It becomes 'Series'.
# Single Series Act's like 1-D Numpy Array # then it follow the addtition rule of numpy array-->> broadcast then perform element-wise sum.

In [29]:
df

      Name  Age         City  Salary
0    Alice   26     New York     200
1      Bob   31  Los Angeles    1000
2  Charlie   36      Chicago     150

- Accessing Rows using .loc[] and .iloc[]

In [10]:
dic={'Name': ['AIS','jaydeep','sujit','pravin','shubham','sourabh'],
    'Age': [40,22,24,21,23,25],
    'Salary':[5000,3000,500,250,150,100]}
df3=pd.DataFrame(dic,index=['a','b','c','d','e','f'])
df3

      Name  Age  Salary
a      AIS   40    5000
b  jaydeep   22    3000
c    sujit   24     500
d   pravin   21     250
e  shubham   23     150
f  sourabh   25     100

In [55]:
df3.loc['a']   # retrive the 'a' index label row

Name       AIS
Age         40
Salary    5000
Name: a, dtype: object

- Selecting multiple Rows

In [56]:
df3.loc['a':'b']   # retrive from 'a' to 'b' all index label rows

      Name  Age  Salary
a      AIS   40    5000
b  jaydeep   22    3000

- Selecting Specific Columns using .loc[]

In [69]:
df3.loc['a':'c',['Name','Salary']]  # Here .loc[] require also column label for column

      Name  Salary
a      AIS    5000
b  jaydeep    3000
c    sujit     500

- Using .iloc[] (Integer-Based Indexing)

In [60]:
df3

      Name  Age  Salary
a      AIS   40    5000
b  jaydeep   22    3000
c    sujit   24     500
d   pravin   21     250
e  shubham   23     150
f  sourabh   25     100

In [62]:
# retrieve the 1st Row
df3.iloc[0]        # by using index position

Name       AIS
Age         40
Salary    5000
Name: a, dtype: object

- Selecting Multiple Rows

In [65]:
# Retrieves rows at index 0 and 1
df3.iloc[0:2]          # Retrieve the Row's of index no -->> 0 and 1

      Name  Age  Salary
a      AIS   40    5000
b  jaydeep   22    3000

- Selecting Specific Columns using .iloc[]

In [71]:
df3.iloc[0:2,[0,2]]  # Here .iloc[] require also column index No. for column

      Name  Salary
a      AIS    5000
b  jaydeep    3000

In [73]:
df3.iloc[0:2,[2]]

   Salary
a    5000
b    3000

In [75]:
df3.iloc[0:2,[0:1]] # for column range Dont put column range in list

SyntaxError: invalid syntax (8637743.py, line 1)

In [77]:
df3.iloc[0:2,0:1] # don't put column range in list

      Name
a      AIS
b  jaydeep

##### Slicing Data in a DataFrame

In [84]:
# Row slicing

In [85]:
df3

      Name  Age  Salary
a      AIS   40    5000
b  jaydeep   22    3000
c    sujit   24     500
d   pravin   21     250
e  shubham   23     150
f  sourabh   25     100

In [94]:
df3[1::2]   #  it gives -->> Row slicing by its index position.

      Name  Age  Salary
b  jaydeep   22    3000
d   pravin   21     250
f  sourabh   25     100

In [96]:
# column Slicing
df3.loc[:,['Name','Salary']]

      Name  Salary
a      AIS    5000
b  jaydeep    3000
c    sujit     500
d   pravin     250
e  shubham     150
f  sourabh     100

In [100]:
df3.loc[:,'Name':'Age']

      Name  Age
a      AIS   40
b  jaydeep   22
c    sujit   24
d   pravin   21
e  shubham   23
f  sourabh   25

In [101]:
df3.iloc[:,0:1]

      Name
a      AIS
b  jaydeep
c    sujit
d   pravin
e  shubham
f  sourabh

In [95]:
df3['Name'].iloc[0::2]

a        AIS
c      sujit
e    shubham
Name: Name, dtype: object

#### drop() Function in Pandas.

In [133]:
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
}
df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [134]:
# Drop a Single Column.-->> Age

In [135]:
df1=df.drop(columns='Name',inplace=False) # here inplace= False-->> means original DataFrame remain unchanged.after droping column 
df1

   Age         City
0   25     New York
1   30  Los Angeles
2   35      Chicago

In [136]:
df               # original DataFrame remain unchanged.after droping column

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [137]:
# Drop a Single Row.-->>with index 1

In [138]:
df.drop(index=1)

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [139]:
df  # original remain unchanged

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [140]:
# Dropping Multiple Columns.
df.drop(columns=['Name','City'])  # get new DataFrame after droping two columns

   Age
0   25
1   30
2   35

In [141]:
# Dropping Multiple Rows-->> with index 0 and 2
df.drop(index=[1,2])

    Name  Age      City
0  Alice   25  New York

In [151]:
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
}
df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [152]:
# Using inplace=True (Modifying Original DataFrame).
df12=df.drop(columns=['Age'], inplace=True)
df12

In [153]:
df

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [156]:
# In .drop() function, use axis=0  means Row and use axis=1 meaning columns

In [157]:
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
}
df11 = pd.DataFrame(data)
df11

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [162]:
df11.drop('City',axis=1)   # axis=1 means -->> columns -->> drop -->> 'City'

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [164]:
df11.drop([0,1],axis=0)    # axis=0 means -->> Row ->> drop -->>  and  index

      Name  Age     City
2  Charlie   35  Chicago

#### sort() Function in Pandas :

In [166]:
# 1. Sorting by Column Values → sort_values()

In [170]:
df22 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [30, 25, 35],
    "Salary": [60000, 50000, 70000]
})
df22

      Name  Age  Salary
0    Alice   30   60000
1      Bob   25   50000
2  Charlie   35   70000

In [173]:
# Sort by a Single Column -->> 'Age'
df22.sort_values(by='Age',ascending=True)  # By default order is ascending

      Name  Age  Salary
1      Bob   25   50000
0    Alice   30   60000
2  Charlie   35   70000

In [174]:
# Sort in Descending Order-->> 'Age'
df22.sort_values('Age',ascending=False)  # ascending =False gives desending order.

      Name  Age  Salary
2  Charlie   35   70000
0    Alice   30   60000
1      Bob   25   50000

In [186]:
# Sort by Multiple Columns
df222 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [45, 100, 150],
    "Salary": [60000, 50000, 70000]
})
df222

      Name  Age  Salary
0    Alice   45   60000
1      Bob  100   50000
2  Charlie  150   70000

In [187]:
df222.sort_values(by=['Age','Salary'],ascending=[True,True])  # Sorts first by Age (ascending), then by Salary (descending).

      Name  Age  Salary
0    Alice   45   60000
1      Bob  100   50000
2  Charlie  150   70000

In [188]:
# Sorting by Index → sort_index()

In [190]:
df111 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [30, 25, 35],
    "Salary": [60000, 50000, 70000]
}, index=["C", "A", "B"])
df111

      Name  Age  Salary
C    Alice   30   60000
A      Bob   25   50000
B  Charlie   35   70000

In [194]:
# Sorting by row index
df111.sort_index(ascending=True)

      Name  Age  Salary
A      Bob   25   50000
B  Charlie   35   70000
C    Alice   30   60000

In [192]:
# Sorting Index in Descending Order
df111.sort_index(ascending=False)

      Name  Age  Salary
C    Alice   30   60000
B  Charlie   35   70000
A      Bob   25   50000

In [197]:
# Sorting by Column Index-->> (axis=1)
df111.sort_index(axis=1,ascending=False)

   Salary     Name  Age
C   60000    Alice   30
A   50000      Bob   25
B   70000  Charlie   35

In [200]:
# IMP # We use inplace=True to Modify Original DataFrame, Without creating new data frame.

### Data Cleaning in pandas :

#### 1) Handling Missing Values:

#### 1)Detecting Missing Values :
     To check if a DataFrame contains missing values (NaN)

In [202]:
# isnull()

In [207]:
import numpy as np
data = {'Name': ['Alice', 'Bob', 'Charlie', np.nan],
        'Age': [25, np.nan, 30, 35],
        'Salary': [50000, 60000, np.nan, 70000]}
df=pd.DataFrame(data)
df

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  30.0      NaN
3      NaN  35.0  70000.0

In [225]:
# check for missing values
df.isnull()

    Name    Age  Salary
0  False  False   False
1  False   True   False
2  False  False    True
3   True  False   False

In [213]:
df.isnull().sum()  # here we can count the no. of missing value in each column

Name      1
Age       1
Salary    1
dtype: int64

In [210]:
# The .isna() function works the same as .isnull(). They are interchangeable.

In [211]:
df.isna()

    Name    Age  Salary
0  False  False   False
1  False   True   False
2  False  False    True
3   True  False   False

In [220]:
df.isnull().any()  #True means that column contains at least one missing value.

Name      True
Age       True
Salary    True
dtype: bool

In [223]:
#  Checking If the Entire DataFrame Has Missing Values
df.isnull().values.any()   # This means there is at least one missing value in the dataset.

True

In [215]:
df.isna().sum()  # here we can count the no. of missing value in each column

Name      1
Age       1
Salary    1
dtype: int64

In [216]:
## Removing Missing Values by .drop()

In [217]:
# 1.Drop rows with any missing values:

In [228]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, np.nan, 30, np.nan],
        'Salary': [50000, 60000, np.nan, 70000]}
df = pd.DataFrame(data)
df

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  30.0      NaN
3    David   NaN  70000.0

In [229]:
#  Dropping Rows with NaN Values
df.dropna(axis=0)

    Name   Age   Salary
0  Alice  25.0  50000.0

In [230]:
# Dropping Columns with NaN Values (axis=1)
df.dropna(axis=1)

      Name
0    Alice
1      Bob
2  Charlie
3    David

In [232]:
df['prise']=[np.nan,np.nan,np.nan,np.nan]

In [233]:
df

      Name   Age   Salary  prise
0    Alice  25.0  50000.0    NaN
1      Bob   NaN  60000.0    NaN
2  Charlie  30.0      NaN    NaN
3    David   NaN  70000.0    NaN

In [234]:
#  Dropping Rows Only If All Values Are NaN (how='all')
df.dropna(axis=0,how='all')

      Name   Age   Salary  prise
0    Alice  25.0  50000.0    NaN
1      Bob   NaN  60000.0    NaN
2  Charlie  30.0      NaN    NaN
3    David   NaN  70000.0    NaN

In [237]:
# Dropping column Only If All Values Are NaN (how='all')
df.dropna(axis=1,how='all')

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  30.0      NaN
3    David   NaN  70000.0

In [242]:
# Dropping Rows with a Threshold of Non-NaN Values (thresh)
df.dropna(thresh=3)

    Name   Age   Salary  prise
0  Alice  25.0  50000.0    NaN

In [243]:
#  Dropping Column with a Threshold of Non-NaN Values (thresh)
df.dropna(thresh=3,axis=1)

      Name   Salary
0    Alice  50000.0
1      Bob  60000.0
2  Charlie      NaN
3    David  70000.0

In [244]:
# Dropping Rows Based on Specific Columns (subset)
df.dropna(subset=['Salary','Age'])

    Name   Age   Salary  prise
0  Alice  25.0  50000.0    NaN

In [246]:
# Using inplace=True to Modify DataFrame Directly
df12=df.dropna(inplace=True)  # here all rows having NaN value so all rows are deleted
df12

In [250]:
df  # store in original 'df' dataframe

Empty DataFrame
Columns: [Name, Age, Salary, prise]
Index: []

#### fillna() in Pandas :

In [251]:
# Replacing NaN with a Fixed Value

In [253]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, np.nan, 30, np.nan],
        'Salary': [50000, 60000, np.nan, 70000]}
df22=pd.DataFrame(data)
df22

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  30.0      NaN
3    David   NaN  70000.0

In [254]:
# fill NaN value with fix value=0

In [256]:
df22.fillna(value=0) # here axis=0 is by default fill column-wise

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   0.0  60000.0
2  Charlie  30.0      0.0
3    David   0.0  70000.0

In [259]:
df22.fillna(1111) # fill NaN value with fixed element

      Name     Age   Salary
0    Alice    25.0  50000.0
1      Bob  1111.0  60000.0
2  Charlie    30.0   1111.0
3    David  1111.0  70000.0

In [ ]:
# Filling NaN with Column Mean

In [261]:
df22.fillna(df22.mean(numeric_only=True))  # here operation perform column-wise

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  27.5  60000.0
2  Charlie  30.0  60000.0
3    David  27.5  70000.0

In [262]:
# Forward Fill (ffill)

In [264]:
df22.fillna(method='ffill')  # here also operation perform column-wise

C:\Users\HP\AppData\Local\Temp\ipykernel_7092\2741794806.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df22.fillna(method='ffill')  # here also operation perform column-wise

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  25.0  60000.0
2  Charlie  30.0  60000.0
3    David  30.0  70000.0

In [268]:
 # Backward Fill (bfill)

In [269]:
df22.fillna(method='bfill')   # here also operation perform column-wise

C:\Users\HP\AppData\Local\Temp\ipykernel_7092\4205498155.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df22.fillna(method='bfill')   # here also operation perform column-wise

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0  60000.0
2  Charlie  30.0  70000.0
3    David   NaN  70000.0

In [270]:
# Filling NaN with Different Values for Each Column

In [272]:
dict1={'Age':22,'Salary':500}  # operation perform column-wise
df22.fillna(value=dict1)

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  22.0  60000.0
2  Charlie  30.0    500.0
3    David  22.0  70000.0

In [273]:
# Filling NaN in Specific Columns

In [281]:
df22['Salary']=df22['Salary'].fillna(222)  # this NaN=222 in column of 'salary' stored in original dataframe df22
df22['Salary']

0    50000.0
1    60000.0
2      222.0
3    70000.0
Name: Salary, dtype: float64

In [279]:
# Using limit Parameter

In [280]:
df22

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  30.0    222.0
3    David   NaN  70000.0

In [294]:
df22.fillna(method='ffill',limit=2) # #  Fill only one consecutive NaN value at most

C:\Users\HP\AppData\Local\Temp\ipykernel_7092\1246630477.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df22.fillna(method='ffill',limit=2) # #  Fill only one consecutive NaN value at most

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  25.0  60000.0
2  Charlie  30.0    222.0
3    David  30.0  70000.0

In [291]:
s=pd.Series([1,2,np.nan,np.nan,np.nan,4,5,np.nan,6,7,8,np.nan,11],name='number')
s

0      1.0
1      2.0
2      NaN
3      NaN
4      NaN
5      4.0
6      5.0
7      NaN
8      6.0
9      7.0
10     8.0
11     NaN
12    11.0
Name: number, dtype: float64

In [296]:
s.fillna(method='ffill',limit=2) #  Fill only two consecutive NaN value at most

C:\Users\HP\AppData\Local\Temp\ipykernel_7092\2889225050.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='ffill',limit=2) #  Fill only two consecutive NaN value at most

0      1.0
1      2.0
2      2.0
3      2.0
4      NaN
5      4.0
6      5.0
7      5.0
8      6.0
9      7.0
10     8.0
11     8.0
12    11.0
Name: number, dtype: float64

In [301]:
s.fillna(value=777,limit=1) # only one consecutive

0       1.0
1       2.0
2     777.0
3       NaN
4       NaN
5       4.0
6       5.0
7       NaN
8       6.0
9       7.0
10      8.0
11      NaN
12     11.0
Name: number, dtype: float64

In [302]:
# Replacing Missing Values by using function -->> .replace()

In [304]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, np.nan, 30, np.nan],
        'Salary': [50000, 60000, np.nan, 70000]}
df11=pd.DataFrame(data)
df11

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  30.0      NaN
3    David   NaN  70000.0

In [306]:
# Replacing NaN with a Fixed Value
df11.replace(value=0,to_replace=np.nan)  # replace all NaN value by 0

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   0.0  60000.0
2  Charlie  30.0      0.0
3    David   0.0  70000.0

In [307]:
# Replacing NaN with Column-Specific Values

In [308]:
df11.replace(value=888,to_replace={'Salary': np.nan})

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  30.0    888.0
3    David   NaN  70000.0

- Renaming Columns & Index by .rename()
- syntax:  df.rename(mapper=None, columns=None, index=None, inplace=False)

In [317]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df

   A  B
0  1  4
1  2  5
2  3  6

In [324]:
# Dictionary mapping of old column names to new names.
# Dictionary mapping of old index labels to new labels.
df.rename(columns={'A': 'AIS','B':'SGM'},index={0:'Row 1',1:'Row 2',2:'Row 3'})

       AIS  SGM
Row 1    1    4
Row 2    2    5
Row 3    3    6

In [326]:
df.rename(mapper={'A': 'AIS'})

   A  B
0  1  4
1  2  5
2  3  6

In [331]:
# Converts all column names to lowercase

df.rename(columns=str.lower)  # we dont write lower with () <<-- paranthesis because we dont give argument

   a  b
0  1  4
1  2  5
2  3  6

- Filtering Based on Text

In [334]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, np.nan, 30, np.nan],
        'Salary': [50000, 60000, np.nan, 70000]}
df11=pd.DataFrame(data)
df11

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  30.0      NaN
3    David   NaN  70000.0

In [336]:
# Filter name's which are starting from 'A'

In [340]:
df11[df11['Name'].str.startswith('A')]   # Filtering Data with -->> Conditions -->> True/False
                                         # Filters -->> rows where Name starts with 'A'.

    Name   Age   Salary
0  Alice  25.0  50000.0

In [12]:
#  Converting Data Types in Pandas by-->>  .to_numeric()

In [4]:
df = pd.DataFrame({'A': ['10', '20', 'abc', '40']})
df

     A
0   10
1   20
2  abc
3   40

In [11]:
pd.to_numeric(df['A'],errors='coerce')  # Error=not-numeric data converted into NaN

0    10.0
1    20.0
2     NaN
3    40.0
Name: A, dtype: float64

## Aggregation and Grouping in pandas :

Aggregation and grouping help summarize large datasets by computing statistics like sum, mean, count, max, min, etc., based on categories or groups.

In [13]:
# aggregation method in pandas

In [14]:
# df.agg(func, axis=0)  --->> syntax

In [17]:
data = {'Category': ['A', 'A', 'B', 'B', 'C'],
        'Values': [10, 20, 30, 40, 50]}
df=pd.DataFrame(data)
df

  Category  Values
0        A      10
1        A      20
2        B      30
3        B      40
4        C      50

In [18]:
# Aggregating a Single Column

In [19]:
df['Values'].agg(func=['mean','sum','count','min','max'])

mean      30.0
sum      150.0
count      5.0
min       10.0
max       50.0
Name: Values, dtype: float64

In [20]:
# Aggregating Multiple Columns.

In [76]:
df = pd.DataFrame({'Category': ['A', 'A', 'B', 'B', 'C'],
                   'Sales': [100, 200, 300, 400, 500],
                   'Profit': [10, 20, 30, 40, 50]})
df

  Category  Sales  Profit
0        A    100      10
1        A    200      20
2        B    300      30
3        B    400      40
4        C    500      50

In [77]:
df.agg({'Sales':['count','mean'],'Profit':['sum','max']})  # we can give seprate fun. list to corresponding column name in dictionary.

       Sales  Profit
count    5.0     NaN
mean   300.0     NaN
sum      NaN   150.0
max      NaN    50.0

### Grouping Data Using groupby() :
  Grouping is used to split the data into groups based on some criteria and then apply aggregation functions.

syntax  -->>  df.groupby('column_name').agg(func)

In [78]:
df

  Category  Sales  Profit
0        A    100      10
1        A    200      20
2        B    300      30
3        B    400      40
4        C    500      50

In [32]:
# Grouping by single column

In [33]:
df.groupby(by='Category')['Profit'].sum()

Category
A    30
B    70
C    50
Name: Profit, dtype: int64

In [39]:
# Grouping by Multiple Columns with multiple aggregation function.

In [81]:
df.groupby('Category').agg({'Sales':['sum'],'Profit':['sum']})

         Sales Profit
           sum    sum
Category
A          300     30
B          700     70
C          500     50

In [40]:
df.groupby('Category').agg({'Sales':['sum','count'],'Profit':['sum','count']})

         Sales       Profit
           sum count    sum count
Category
A          300     2     30     2
B          700     2     70     2
C          500     1     50     1

In [82]:
df.groupby('Category').sum()  # aplly for all available numeric column

          Sales  Profit
Category
A           300      30
B           700      70
C           500      50

In [83]:
# Grouping by Multiple Columns

In [84]:
data = {'Region': ['North', 'North', 'South', 'South', 'East', 'East'],
        'Category': ['A', 'A', 'B', 'B', 'C', 'C'],
        'Sales': [100, 200, 300, 400, 500, 600]}
df = pd.DataFrame(data)
df

  Region Category  Sales
0  North        A    100
1  North        A    200
2  South        B    300
3  South        B    400
4   East        C    500
5   East        C    600

In [86]:
df.groupby(['Region','Category'])['Sales'].count()

Region  Category
East    C           2
North   A           2
South   B           2
Name: Sales, dtype: int64

In [88]:
df.groupby(['Region','Category']).count()

                 Sales
Region Category
East   C             2
North  A             2
South  B             2

### Transform and Apply Functions to Groups

In [41]:
df

  Category  Sales  Profit
0        A    100      10
1        A    200      20
2        B    300      30
3        B    400      40
4        C    500      50

- apply method

In [47]:
def ternover(a):
    return a.sum() - a.min()

In [49]:
df.groupby(by='Category')['Sales'].apply(ternover)  # Apply customies function -->> on Group by

Category
A    200
B    400
C      0
Name: Sales, dtype: int64

- transpose method

In [52]:
# Calculate mean sales for each category and assign to original DataFrame

In [65]:
df.groupby('Category')['Profit'].mean()

Category
A    15.0
B    35.0
C    50.0
Name: Profit, dtype: float64

In [72]:
df.groupby('Category')['Profit'].transform('mean')  # give assign in original DataFrame with New column name

0    15.0
1    15.0
2    35.0
3    35.0
4    50.0
Name: Profit, dtype: float64

In [73]:
df

  Category  Sales  Profit   New
0        A    100      10  15.0
1        A    200      20  15.0
2        B    300      30  35.0
3        B    400      40  35.0
4        C    500      50  50.0

In [74]:
df['AIS']=df.groupby('Category')['Sales'].transform('mean')
df['AIS']

0    150.0
1    150.0
2    350.0
3    350.0
4    500.0
Name: AIS, dtype: float64

In [75]:
df                         # Returns transformed values while keeping the original shape.

  Category  Sales  Profit   New    AIS
0        A    100      10  15.0  150.0
1        A    200      20  15.0  150.0
2        B    300      30  35.0  350.0
3        B    400      40  35.0  350.0
4        C    500      50  50.0  500.0

### pd.merge() vs. pd.concat() in Pandas :

Both pd.merge() and pd.concat() are used to combine multiple DataFrames, but they serve different purposes:
  1) pd.merge() is used for SQL-like joins (inner, left, right, outer) based on common columns.
  2) pd.concat() is used to concatenate DataFrames along rows (axis=0) or columns (axis=1).

pd.merge() -->> syntax -->>
pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, 
         left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'),
         copy=True, indicator=False, validate=None)

In [18]:
# Inner Join (how='inner')   # Here fill all missing value by NaN

In [4]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Salary': [5000, 7000, 9000]})

In [6]:
pd.merge(df1,df2,on='ID',how='inner')   # Only matching ID values (2 and 3) are included.

   ID     Name  Salary
0   2      Bob    5000
1   3  Charlie    7000

In [7]:
# Outer Join (how='outer')

In [32]:
pd.merge(df1,df2,on='ID',how='outer',indicator=True) # Keeps all rows from both DataFrames, fills missing values (NaN) where no match exists.
                                           # Shows the source of each row (both, left_only, right_only).

   ID   Dept_x  Salary   Dept_y  Bonus _merge
0   1       HR    5000       HR   1000   both
1   2       IT    6000       IT   1500   both
2   3  Finance    7000  Finance   2000   both

In [10]:
# Left Join (how='left')

In [12]:
pd.merge(df1,df2,on='ID',how='left') #  Keeps all rows from the left DataFrame and only matching rows from the right DataFrame.

   ID     Name  Salary
0   1    Alice     NaN
1   2      Bob  5000.0
2   3  Charlie  7000.0

In [13]:
# Right Join (how='right')

In [15]:
pd.merge(df1,df2,on='ID',how='right') # Keeps all rows from the right dataframe and only matching rows from the left dataframe

   ID     Name  Salary
0   2      Bob    5000
1   3  Charlie    7000
2   4      NaN    9000

In [16]:
# Merging on Different Column Names

In [19]:
df1 = pd.DataFrame({'Employee_ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'EmpID': [2, 3, 4], 'Salary': [5000, 7000, 9000]})

In [20]:
pd.merge(df1,df2,left_on='Employee_ID',right_on='EmpID',how='inner')

   Employee_ID     Name  EmpID  Salary
0            2      Bob      2    5000
1            3  Charlie      3    7000

In [21]:
# Joining DataFrames (df.join())

syntax -->> df1.join(df2, on=None, how='left', lsuffix='', rsuffix='', sort=False)

In [23]:
# join() is a simplified version of merge(). It joins on index by default.

In [24]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie']}, index=[1, 2, 3])
df2 = pd.DataFrame({'Salary': [5000, 7000, 9000]}, index=[2, 3, 4])

In [26]:
df1.join(df2,how='left')  #  Bydefault how='left' # join() works on index, where merge() requires a key column.

      Name  Salary
1    Alice     NaN
2      Bob  5000.0
3  Charlie  7000.0

In [27]:
# Merging on Multiple Columns

In [28]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Dept': ['HR', 'IT', 'Finance'], 'Salary': [5000, 6000, 7000]})
df2 = pd.DataFrame({'ID': [1, 2, 3], 'Dept': ['HR', 'IT', 'Finance'], 'Bonus': [1000, 1500, 2000]})

In [30]:
pd.merge(df1,df2,on=['ID','Dept'],how='inner') # Here Merging is done using two key columns (ID and Dept).

   ID     Dept  Salary  Bonus
0   1       HR    5000   1000
1   2       IT    6000   1500
2   3  Finance    7000   2000

### pd.concat() – Concatenating DataFrames :
        Used for: Stacking DataFrames vertically (rows) or horizontally (columns).

syntax -->> pd.concat(objs, axis=0, join='outer', ignore_index=False, keys=None, 
          levels=None, names=None, verify_integrity=False, sort=False, copy=True)

In [33]:
# Vertical Concatenation (axis=0)

In [34]:
df1 = pd.DataFrame({'ID': [1, 2], 'Name': ['Alice', 'Bob']})
df2 = pd.DataFrame({'ID': [3, 4], 'Name': ['Charlie', 'David']})

In [35]:
pd.concat([df1,df2],axis=0)

   ID     Name
0   1    Alice
1   2      Bob
0   3  Charlie
1   4    David

In [37]:
pd.concat([df1,df2],axis=0,ignore_index=True)  # we cen ignore old index and create new one index

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

In [38]:
# Horizontal Concatenation (axis=1)

In [39]:
df1 = pd.DataFrame({'ID': [1, 2], 'Name': ['Alice', 'Bob']})
df2 = pd.DataFrame({'Salary': [5000, 7000]})

In [41]:
pd.concat([df1,df2],axis=1,join='outer') # 'outer' (default) keeps all columns, 'inner' keeps only common columns.

   ID   Name  Salary
0   1  Alice    5000
1   2    Bob    7000

In [43]:
# Concatenating with join='inner'

In [44]:
df1 = pd.DataFrame({'ID': [1, 2], 'Name': ['Alice', 'Bob'], 'Age': [25, 30]})
df2 = pd.DataFrame({'ID': [3, 4], 'Salary': [5000, 7000]})

In [47]:
pd.concat([df1,df2],axis=0,ignore_index=True,join='inner') # 'inner' keeps only common columns.

   ID
0   1
1   2
2   3
3   4

In [48]:
# Using keys for MultiIndex

In [50]:
pd.concat([df1,df2],axis=0,join='outer',keys=['dataset1','dataset2'])

            ID   Name   Age  Salary
dataset1 0   1  Alice  25.0     NaN
         1   2    Bob  30.0     NaN
dataset2 0   3    NaN   NaN  5000.0
         1   4    NaN   NaN  7000.0

In [51]:
# Verifying Index Integrity (verify_integrity=True)

In [52]:
df1 = pd.DataFrame({'ID': [1, 2], 'Name': ['Alice', 'Bob']}, index=[0, 1])
df2 = pd.DataFrame({'ID': [3, 4], 'Name': ['Charlie', 'David']}, index=[0, 1])

In [54]:
pd.concat([df1,df2],axis=0,verify_integrity=True)  # Raises an error if duplicate index values exist.

ValueError: Indexes have overlapping values: Index([0, 1], dtype='int64')

In [56]:
pd.concat([df1,df2],axis=0,verify_integrity=False)  # here we solve ERROR

   ID     Name
0   1    Alice
1   2      Bob
0   3  Charlie
1   4    David

### File I/O in Pandas: read_csv(), to_csv(), read_excel(), to_excel() :
       Pandas provides several functions for reading and writing data in different formats, such as CSV and Excel files.

pd.read_csv() – Reading CSV Files:
   1) Used for: Importing data from CSV (Comma-Separated Values) files into a Pandas DataFrame.
   2) syntax-->> pd.read_csv(filepath, sep=',', header=0, names=None, index_col=None, usecols=None, dtype=None, nrows=None, skiprows=None, encoding=None)

Parameter   Description

1) filepath	- Path to the CSV file.
2) sep         - Default is , (comma). Can specify other delimiters like '\t' for tab-separated files.
3) header   	- Row number to use as column names. Default is 0 (first row). Use None for no headers.
4) names       - List of column names if header=None.
5) index_col	- Column to set as index. Default is None.
6) usecols	    - List of column names/numbers to import specific columns.
7) dtype	    - Dictionary to specify column data types.
8) nrows	    - Number of rows to read (useful for large files).
9) skiprows	- Number of rows to skip at the start.
10) encoding	- Encoding format (e.g., 'utf-8', 'latin-1').

df.to_csv() – Writing CSV Files
  1)  Used for: Exporting a Pandas DataFrame to a CSV file.
  2)  syntax-->> df.to_csv(filepath, sep=',', index=True, header=True, encoding=None, mode='w')

Parameter  Description

1) filepath	- Path to save the CSV file.
2) sep	        - Separator to use (default is ,).
3) index	    - Whether to write the index column (True by default).
4) header   	- Whether to include column headers (True by default).
5) encoding	- Encoding format (e.g., 'utf-8', 'latin-1').
6) mode        - 'w' (overwrite), 'a' (append).

pd.read_excel() – Reading Excel Files
  1) Used for: Importing data from Excel (.xlsx) files into Pandas.
  2) syntax -->> pd.read_excel(filepath, sheet_name=0, header=0, names=None, usecols=None, dtype=None, nrows=None, skiprows=None, engine=None)

Parameter	Description

1) filepath 	- Path to the Excel file.
2) sheet_name	- Name or index of the sheet (default is 0 - first sheet).
3) header	    - Row to use as column names.
4) names	    - List of column names.
5) usecols	    - Specific columns to load.
6) dtype	    - Data type for columns.
7) nrows	    - Number of rows to read.
8) skiprows  	- Number of rows to skip.
9) engine	    - 'openpyxl' (default) or 'xlrd' for older .xls files.

 df.to_excel() – Writing Excel Files.
 
    1) Used for: Exporting a Pandas DataFrame to an Excel file.
    2) syntax --->> df.to_excel(filepath, sheet_name='Sheet1', index=True, header=True, engine=None)

Parameter	Description

1) filepath	    - Path to save the Excel file.
2) sheet_name	- Name of the sheet to write ('Sheet1' by default).
3) index	    -  Whether to write the index column (True by default).
4) header	    - Whether to include column headers (True by default).
5) engine	    - 'openpyxl' for .xlsx (default), 'xlrd' for .xls.

##  Time Series in Pandas: pd.to_datetime() & .resample() :
         Pandas provides powerful tools for handling -->> time series data, including date conversion, time-based indexing, and resampling.

### pd.to_datetime() – Converting to Datetime Format 
       1) Used for: Converting a column or value into a pandas-->> datetime object, making it easier to handle date/time operations.
       2) syntax -->> pd.to_datetime(arg, errors='raise', dayfirst=False, yearfirst=False, format=None, 
               utc=False, infer_datetime_format=False, origin='unix', unit=None, cache=True)

Parameter	Description

1) arg	    - The data to convert (string, list, array, Series, DataFrame).
2) errors	- 'raise' (default) - throws error for invalid values, 'coerce' - replaces invalid values with NaT, 'ignore' - returns input unchanged.
3) dayfirst  - If True, interprets date format as DD/MM/YYYY instead of MM/DD/YYYY.
4) yearfirst - If True, interprets date format as YYYY/MM/DD.
5) format   - 	Manually specify the date format (e.g., "%Y-%m-%d" for "2024-02-01").
6) utc	 - If True, converts timezone to UTC.
7) infer_datetime_format - 	If True, speeds up parsing for consistent date formats.
8) origin - Default is 'unix' (1970-01-01), can be 'julian' for Julian dates.
9) unit	 - The unit of timestamps (e.g., 's' for seconds, 'ms' for milliseconds).
10) cache	- If True, caches unique values for efficiency.

In [61]:
# Convert a date String to datetime

In [129]:
date_str = "08-12-2024"

In [133]:
pd.to_datetime(arg=date_str,dayfirst=True)

Timestamp('2024-12-08 00:00:00')

In [67]:
# Convert a Series of Dates.

In [71]:
s= pd.Series(["2024-01-01", "2024-02-15", "2024-03-20"]) # -->> object = dtype
s

0    2024-01-01
1    2024-02-15
2    2024-03-20
dtype: object

In [72]:
pd.to_datetime(arg=date_series)   # -->> datetime64[ns] = dtype

0   2024-01-01
1   2024-02-15
2   2024-03-20
dtype: datetime64[ns]

In [73]:
# Handling Invalid Dates Using errors='coerce'

In [74]:
date_series= pd.Series(["2024-01-01", "invalid_date", "2024-03-20"])
date_series

0      2024-01-01
1    invalid_date
2      2024-03-20
dtype: object

In [77]:
pd.to_datetime(date_series,errors='raise')  # invalid_date is present

ValueError: time data "invalid_date" doesn't match format "%Y-%m-%d", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [79]:
pd.to_datetime(date_series,errors='coerce')  # The invalid date will be replaced with NaT (Not a Time).

0   2024-01-01
1          NaT
2   2024-03-20
dtype: datetime64[ns]

In [86]:
# Convert Unix Timestamp to Datetime

In [87]:
timestamps = [1704067200, 1706745600]  # Unix timestamps (seconds)
timestamps

[1704067200, 1706745600]

In [92]:
pd.to_datetime(timestamps) # julian time

DatetimeIndex(['1970-01-01 00:00:01.704067200', '1970-01-01 00:00:01.706745600'], dtype='datetime64[ns]', freq=None)

In [93]:
pd.to_datetime(timestamps,unit='s')

DatetimeIndex(['2024-01-01', '2024-02-01'], dtype='datetime64[ns]', freq=None)

In [94]:
timestamps1 = [123456789,123456]  # Unix timestamps (seconds)
pd.to_datetime(timestamps1)  # julian time

DatetimeIndex(['1970-01-01 00:00:00.123456789', '1970-01-01 00:00:00.000123456'], dtype='datetime64[ns]', freq=None)

In [95]:
ais=pd.to_datetime(timestamps1)
ais

DatetimeIndex(['1970-01-01 00:00:00.123456789', '1970-01-01 00:00:00.000123456'], dtype='datetime64[ns]', freq=None)

In [116]:
# Convert with yearfirst=True

In [117]:
pd.to_datetime(date_str,yearfirst=True) # year - month -day

Timestamp('2024-02-01 00:00:00')

In [102]:
# Convert a DataFrame Column to Datetime

In [103]:
df = pd.DataFrame({'Date': ["2024-01-01", "2024-02-15", "2024-03-20"]})
df

         Date
0  2024-01-01
1  2024-02-15
2  2024-03-20

In [109]:
df['Date']=pd.to_datetime(df['Date'])
df['Date']

0   2024-01-01
1   2024-02-15
2   2024-03-20
Name: Date, dtype: datetime64[ns]

### resample() in Pandas :
       The .resample() function in Pandas is used for time series data to group and aggregate data based on a new time frequency. It is commonly used to change the frequency of datetime-based data (e.g., from daily to monthly, from hourly to weekly, etc.).

#### syntax  --->> df.resample(rule, on=None).agg(function)

Parameter	Description

1) rule	- Defines the new time frequency (e.g., 'D' for daily, 'M' for monthly).
2) on	- The column containing datetime values (used if the index is not a datetime type).
3) agg(function) -	The aggregation function to apply (e.g., sum(), mean(), count()).

In [113]:
# Resampling -->> Time Series DataFrame

In [159]:
#  Creating a sample time series DataFrame

date=pd.date_range(start='2024-01-01',periods=10,freq='D')
date

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10'],
              dtype='datetime64[ns]', freq='D')

In [162]:
# now we make datetime included dataframe

In [141]:
df=pd.DataFrame({'Date': date,'sales':[10,20,30,40,50,60,70,80,90,100]})
df

        Date  sales
0 2024-01-01     10
1 2024-01-02     20
2 2024-01-03     30
3 2024-01-04     40
4 2024-01-05     50
5 2024-01-06     60
6 2024-01-07     70
7 2024-01-08     80
8 2024-01-09     90
9 2024-01-10    100

In [143]:
# Now set 'Date' column as -->> Index in above dataframe 'df'

In [144]:
df.set_index('Date',inplace=True)

In [145]:
df

            sales
Date
2024-01-01     10
2024-01-02     20
2024-01-03     30
2024-01-04     40
2024-01-05     50
2024-01-06     60
2024-01-07     70
2024-01-08     80
2024-01-09     90
2024-01-10    100

In [151]:
# Now here we make group (Resample) of (7 days) to make (one week) 
# here we change daily frequency into weekly frequency by grouping (7 days)

In [148]:
df.resample('W').sum()

            sales
Date
2024-01-07    280
2024-01-14    270

In [154]:
df.resample('M').sum() # here we concider for only one month resample(group)

C:\Users\HP\AppData\Local\Temp\ipykernel_8036\1118370385.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  df.resample('M').sum() # here we concider for only one month resample(group)

            sales
Date
2024-01-31    550

In [173]:
# 1. Resampling Hourly Data frequency to Daily frequency and use Sum aggregate

In [160]:
hour=pd.date_range(start='2024-01-01',periods=50,freq='H')
hour

C:\Users\HP\AppData\Local\Temp\ipykernel_8036\334486172.py:1: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  hour=pd.date_range(start='2024-01-01',periods=50,freq='H')

DatetimeIndex(['2024-01-01 00:00:00', '2024-01-01 01:00:00',
               '2024-01-01 02:00:00', '2024-01-01 03:00:00',
               '2024-01-01 04:00:00', '2024-01-01 05:00:00',
               '2024-01-01 06:00:00', '2024-01-01 07:00:00',
               '2024-01-01 08:00:00', '2024-01-01 09:00:00',
               '2024-01-01 10:00:00', '2024-01-01 11:00:00',
               '2024-01-01 12:00:00', '2024-01-01 13:00:00',
               '2024-01-01 14:00:00', '2024-01-01 15:00:00',
               '2024-01-01 16:00:00', '2024-01-01 17:00:00',
               '2024-01-01 18:00:00', '2024-01-01 19:00:00',
               '2024-01-01 20:00:00', '2024-01-01 21:00:00',
               '2024-01-01 22:00:00', '2024-01-01 23:00:00',
               '2024-01-02 00:00:00', '2024-01-02 01:00:00',
               '2024-01-02 02:00:00', '2024-01-02 03:00:00',
               '2024-01-02 04:00:00', '2024-01-02 05:00:00',
               '2024-01-02 06:00:00', '2024-01-02 07:00:00',
               '2024-01-02 08:00:00', '2024-01-02 09:00:00',
               '2024-01-02 10:00:00', '2024-01-02 11:00:00',
               '2024-01-02 12:00:00', '2024-01-02 13:00:00',
               '2024-01-02 14:00:00', '2024-01-02 15:00:00',
               '2024-01-02 16:00:00', '2024-01-02 17:00:00',
               '2024-01-02 18:00:00', '2024-01-02 19:00:00',
               '2024-01-02 20:00:00', '2024-01-02 21:00:00',
               '2024-01-02 22:00:00', '2024-01-02 23:00:00',
               '2024-01-03 00:00:00', '2024-01-03 01:00:00'],
              dtype='datetime64[ns]', freq='h')

In [174]:
# 2.now we make datetime included dataframe

In [171]:
df2=pd.DataFrame({'Hour':hour,'Value': range(50)})
df2

                  Hour  Value
0  2024-01-01 00:00:00      0
1  2024-01-01 01:00:00      1
2  2024-01-01 02:00:00      2
3  2024-01-01 03:00:00      3
4  2024-01-01 04:00:00      4
5  2024-01-01 05:00:00      5
6  2024-01-01 06:00:00      6
7  2024-01-01 07:00:00      7
8  2024-01-01 08:00:00      8
9  2024-01-01 09:00:00      9
10 2024-01-01 10:00:00     10
11 2024-01-01 11:00:00     11
12 2024-01-01 12:00:00     12
13 2024-01-01 13:00:00     13
14 2024-01-01 14:00:00     14
15 2024-01-01 15:00:00     15
16 2024-01-01 16:00:00     16
17 2024-01-01 17:00:00     17
18 2024-01-01 18:00:00     18
19 2024-01-01 19:00:00     19
20 2024-01-01 20:00:00     20
21 2024-01-01 21:00:00     21
22 2024-01-01 22:00:00     22
23 2024-01-01 23:00:00     23
24 2024-01-02 00:00:00     24
25 2024-01-02 01:00:00     25
26 2024-01-02 02:00:00     26
27 2024-01-02 03:00:00     27
28 2024-01-02 04:00:00     28
29 2024-01-02 05:00:00     29
30 2024-01-02 06:00:00     30
31 2024-01-02 07:00:00     31
32 2024-01-02 08:00:00     32
33 2024-01-02 09:00:00     33
34 2024-01-02 10:00:00     34
35 2024-01-02 11:00:00     35
36 2024-01-02 12:00:00     36
37 2024-01-02 13:00:00     37
38 2024-01-02 14:00:00     38
39 2024-01-02 15:00:00     39
40 2024-01-02 16:00:00     40
41 2024-01-02 17:00:00     41
42 2024-01-02 18:00:00     42
43 2024-01-02 19:00:00     43
44 2024-01-02 20:00:00     44
45 2024-01-02 21:00:00     45
46 2024-01-02 22:00:00     46
47 2024-01-02 23:00:00     47
48 2024-01-03 00:00:00     48
49 2024-01-03 01:00:00     49

In [175]:
# Now make 'Hour' column as index of dataframe

In [176]:
df2.set_index('Hour',inplace=True)

In [177]:
df2

                     Value
Hour
2024-01-01 00:00:00      0
2024-01-01 01:00:00      1
2024-01-01 02:00:00      2
2024-01-01 03:00:00      3
2024-01-01 04:00:00      4
2024-01-01 05:00:00      5
2024-01-01 06:00:00      6
2024-01-01 07:00:00      7
2024-01-01 08:00:00      8
2024-01-01 09:00:00      9
2024-01-01 10:00:00     10
2024-01-01 11:00:00     11
2024-01-01 12:00:00     12
2024-01-01 13:00:00     13
2024-01-01 14:00:00     14
2024-01-01 15:00:00     15
2024-01-01 16:00:00     16
2024-01-01 17:00:00     17
2024-01-01 18:00:00     18
2024-01-01 19:00:00     19
2024-01-01 20:00:00     20
2024-01-01 21:00:00     21
2024-01-01 22:00:00     22
2024-01-01 23:00:00     23
2024-01-02 00:00:00     24
2024-01-02 01:00:00     25
2024-01-02 02:00:00     26
2024-01-02 03:00:00     27
2024-01-02 04:00:00     28
2024-01-02 05:00:00     29
2024-01-02 06:00:00     30
2024-01-02 07:00:00     31
2024-01-02 08:00:00     32
2024-01-02 09:00:00     33
2024-01-02 10:00:00     34
2024-01-02 11:00:00     35
2024-01-02 12:00:00     36
2024-01-02 13:00:00     37
2024-01-02 14:00:00     38
2024-01-02 15:00:00     39
2024-01-02 16:00:00     40
2024-01-02 17:00:00     41
2024-01-02 18:00:00     42
2024-01-02 19:00:00     43
2024-01-02 20:00:00     44
2024-01-02 21:00:00     45
2024-01-02 22:00:00     46
2024-01-02 23:00:00     47
2024-01-03 00:00:00     48
2024-01-03 01:00:00     49

In [178]:
# now resampling hourly frequency to daily frequency by grouping (first 24 hourly observation) == (1 day)

In [179]:
df2.resample('D').count()

            Value
Hour
2024-01-01     24
2024-01-02     24
2024-01-03      2

### Commonly Used Frequency Codes:

Code	Time Frequency

1) 'D' -	Daily
2) 'W' -	Weekly
3) 'M' -	Monthly
4) 'Q' -	Quarterly
5) 'Y'	 -Yearly
6) 'H'	 - Hourly
7) 'T'  -	Minute     (monthly = 'M')
8) 'S' - Seconds